package structures

var SubtopicDB = map[int]string{
	// технологии (1xx)
	101: "Как ИИ влияет на рынок труда?",
	102: "Этика в разработке новых технологий",
	103: "Развитие квантовых вычислений",
	104: "Интернет вещей (IoT)",
	105: "Кибербезопасность",

	// здоровье (2xx)
	201: "Здоровое питание",
	202: "Физическая активность",
	203: "Психическое здоровье",
	204: "Медитация и релаксация",
	205: "Профилактика заболеваний",

	// образование (3xx)
	301: "Онлайн-курсы",
	302: "Чтение и литература",
	303: "Языковое обучение",
	304: "Навыки будущего",
	305: "Образовательные технологии",

	// искусство (4xx)
	401: "Современное искусство",
	402: "Классическая музыка",
	403: "Кино и театр",
	404: "Литература и поэзия",
	405: "Культурное наследие",

	// путешествия (5xx)
	501: "Популярные направления",
	502: "Культурные путешествия",
	503: "Приключенческий туризм",
	504: "Путешествия с семьей",
	505: "Фотография путешествий",

	// экология (6xx)
	601: "Возобновляемая энергия",
	602: "Эко-инициативы",
	603: "Зеленые технологии",
	604: "Сохранение биоразнообразия",
	605: "Устойчивое потребление",
}
